//┏━━━━━━━━━━━━┓
//┃  通信Format対応 Macro  ┃
//┗━━━━━━━━━━━━┛
// ===== 使用時の注意事項 =====
//  ・複数行ﾏｸﾛなので注意!
//      NG Pattern例(特定条件成立時ﾃﾞｰﾀをｾｯﾄ)
//         if ( XXXX )
//           CF2_US( ptr ) ;
//
//      OK Pattern例特(定条件成立時ﾃﾞｰﾀをｾｯﾄ)
//         if ( XXXX ) {
//           CF2_US( ptr ) ;
//         }
//
//  ・引数は複数回使用する為､++,--等は厳禁
//  ・変換対象CommunicationFormatは､上位Bit→下位Bit並び

//--- Macro ------------------------------------------------
// 機  能 : 通信2Byteﾃﾞｰﾀ→符号無16bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : US      : 読出した符号無16bit値を返す
//----------------------------------------------------------
#define	CF2_US( ptr )	(   ( (US)( *((UC *)ptr  ) ) <<  8 ) \
						  |   (US)( *((UC *)ptr+1) )         )

//--- Macro ------------------------------------------------
// 機  能 : 通信2Byteﾃﾞｰﾀ→符号有り16bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : SS      : 読出した符号有り16bit値を返す
//----------------------------------------------------------
#define	CF2_SS( ptr )	( SS )(   ( (US)( *((UC *)ptr  ) ) <<  8 ) \
						        |   (US)( *((UC *)ptr+1) )         )

//--- Macro ------------------------------------------------
// 機  能 : 通信3Byteﾃﾞｰﾀ→符号無32bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : UL      : 読出した符号無32bit値を返す
//----------------------------------------------------------
#define	CF3_UL( ptr )	(   ( (UL)( *((UC *)ptr  ) ) << 16 ) \
						  | ( (UL)( *((UC *)ptr+1) ) <<  8 ) \
						  |   (UL)( *((UC *)ptr+2) )         )

//--- Macro ------------------------------------------------
// 機  能 : 通信3Byteﾃﾞｰﾀ→符号有り32bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : SL      : 読出した符号有り32bit値を返す
//----------------------------------------------------------
#define	CF3_SL( ptr )	( SL )(   ( (UL)( *((UC *)ptr  ) ) << 16 ) \
								| ( (UL)( *((UC *)ptr+1) ) <<  8 ) \
								|   (UL)( *((UC *)ptr+2) )         )

//--- Macro ------------------------------------------------
// 機  能 : 通信4Byteﾃﾞｰﾀ→符号無32bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : UL      : 読出した符号無32bit値を返す
//----------------------------------------------------------
#define	CF4_UL( ptr )	(   ( (UL)( *((UC *)ptr  ) ) << 24 ) \
						  | ( (UL)( *((UC *)ptr+1) ) << 16 ) \
						  | ( (UL)( *((UC *)ptr+2) ) <<  8 ) \
						  |   (UL)( *((UC *)ptr+3) )         )

//--- Macro ------------------------------------------------
// 機  能 : 通信4Byteﾃﾞｰﾀ→符号有り32bitに読出し
// 引  数 : UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : SL      : 読出した符号有り32bit値を返す
//----------------------------------------------------------
#define	CF4_SL( ptr )	( SL )(   ( (UL)( *((UC *)ptr  ) ) << 24 ) \
								| ( (UL)( *((UC *)ptr+1) ) << 16 ) \
								| ( (UL)( *((UC *)ptr+2) ) <<  8 ) \
								|   (UL)( *((UC *)ptr+3) )         )

//--- Macro ------------------------------------------------
// 機  能 : 符号無32bit→通信4Byteﾃﾞｰﾀへ書出し
// 引  数 : UL  dat : 32bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	UL_CF4( dat , ptr )	*((UC *)ptr  ) = (UC)( (UL)dat >> 24 ); \
							*((UC *)ptr+1) = (UC)( (UL)dat >> 16 ); \
							*((UC *)ptr+2) = (UC)( (UL)dat >>  8 ); \
							*((UC *)ptr+3) = (UC)( (UL)dat       )

//--- Macro ------------------------------------------------
// 機  能 : 符号有り32bit→通信4Byteﾃﾞｰﾀへ書出し
// 引  数 : SL  dat : 32bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	SL_CF4( dat , ptr )	*((UC *)ptr  ) = (UC)( (SL)dat >> 24 ); \
							*((UC *)ptr+1) = (UC)( (SL)dat >> 16 ); \
							*((UC *)ptr+2) = (UC)( (SL)dat >>  8 ); \
							*((UC *)ptr+3) = (UC)( (SL)dat       )

//--- Macro ------------------------------------------------
// 機  能 : 符号無32bit→通信3Byteﾃﾞｰﾀへ書出し
// 引  数 : UL  dat : 32bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	UL_CF3( dat , ptr )	*((UC *)ptr  ) = (UC)( (UL)dat >> 16 ); \
							*((UC *)ptr+1) = (UC)( (UL)dat >>  8 ); \
							*((UC *)ptr+2) = (UC)( (UL)dat       )


//--- Macro ------------------------------------------------
// 機  能 : 符号有り32bit→通信3Byteﾃﾞｰﾀへ書出し
// 引  数 : SL  dat : 32bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	SL_CF3( dat , ptr )	*((UC *)ptr  ) = (UC)( (SL)dat >> 16 ); \
							*((UC *)ptr+1) = (UC)( (SL)dat >>  8 ); \
							*((UC *)ptr+2) = (UC)( (SL)dat       )

//--- Macro ------------------------------------------------
// 機  能 : 符号無16bit→通信2Byteﾃﾞｰﾀへ書出し
// 引  数 : US  dat : 16bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	US_CF2( dat , ptr )	*((UC *)ptr  ) = (UC)( (US)dat >> 8 ); \
							*((UC *)ptr+1) = (UC)( (US)dat      )

//--- Macro ------------------------------------------------
// 機  能 : 符号有り16bit→通信2Byteﾃﾞｰﾀへ書出し
// 引  数 : SS  dat : 16bit書出し値
//          UC *ptr : 通信ﾃﾞｰﾀへのUC型ﾎﾟｲﾝﾀ
// 戻り値 : 無し
//----------------------------------------------------------
#define	SS_CF2( dat , ptr )	*((UC *)ptr  ) = (UC)( (SS)dat >> 8 ); \
							*((UC *)ptr+1) = (UC)( (SS)dat      )